package lec02;

// 2강. 테스트 코드란 무엇인가?! 그리고 왜 필요한가?!
// 1. 테스트 코드란 무엇인가?!
// - 테스트 : 무언가를 검사한다.
// - 코드 : 프로그래밍 코드
// - 테스트 코드 : 프로그래밍 코드를 사용해 무엇인가를 검증한다.
//               자동으로(사람의 손을 거치지 않고) 테스트를 할 수 있다!

// 2. 테스트 코드는 왜 필요한가?! (테스트 코드의 장점)
// 1) 개발 과정에서 문제를 미리 발견할 수 있다.
// 2) 기능 추가와 리펙토링을 안심하고 할 수 있다.
// 3) 빠른 시간 내 코드의 동작 방식과 결과를 확인할 수 있다.
// 4) 좋은 테스트 코드를 작성하려 하다보면, 자연스럽게 좋은 코드가 만들어 진다.
// 5) 잘 작성한 테스트는 문저 역할을 한다. (코드 리뷰를 돕는다.)
// 쉽게 말해, 눈물을 흘리지 않기 위해 테스트 코드를 작성해야 한다.

// 다음 시간 예고
// 1) 순수하게 Kotlin으로만 테스트 코드를 작성해보고
// 2) Junit5의 사용법을 배운 후 테스트 코드 리펙토링을 해보고
// 3) Spring Boot에서 어떤 테스트를 어떻게 작성할지 살펴보고
// 4) 실제 도서관리 애플리케이션의 테스트 코드를 작성해보겠음~~